month = int(input("Введите номер месяца от 1 до 12: "))
year = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето", 9: "Осень", 10: "Осень", 11: "Осень", 12: "Зима"}

while True:
    if 12 < month < 0:
        print("Ошибка ввода")
        month = int(input("Введите номер месяца от 1 до 12: "))
    else:
        print(year.get(month))
        break

# -------------------------------------ИЛИ----------------------------------------------

month_num = int(input("Введите номер месяца от 1 до 12: "))
months = ["Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень", "Осень", "Осень", "Зима"]

while True:
    if month_num < 0 or month_num > 12:
        print("Ошибка ввода")
        month_num = int(input("Введите номер месяца от 1 до 12: "))
    else:
        print(months[month_num - 1])
        break

